import json
import random

first_names_male = [
    "Александр", "Иван", "Павел", "Дмитрий", "Алексей", "Тони", "Владимир",
    "Михаил", "Сергей", "Николай", "Андрей", "Евгений", "Максим", "Олег",
    "Виктор", "Юрий", "Григорий", "Виталий", "Артем", "Константин", "Роман",
    "Борис", "Леонид", "Валерий", "Василий", "Кирилл", "Станислав", "Эдуард",
    "Никита", "Аркадий", "Денис", "Петр", "Федор", "Глеб", "Илья", "Захар",
    "Вячеслав", "Марк", "Тимур", "Антон", "Игнат", "Геннадий", "Анатолий",
    "Ростислав", "Савелий", "Юлиан", "Марат", "Руслан", "Гавриил", "Лазарь",
    "Гордей", "Даниил", "Альберт", "Арсен", "Владислав", "Елисей", "Семен"
]

first_names_female = [
    "Мария", "Ольга", "Светлана", "Екатерина", "Анна", "Наталья", "Татьяна",
    "Елена", "Алина", "Юлия", "Виктория", "Лариса", "Дарья", "Вероника",
    "Александра", "Полина", "Ирина", "Людмила", "Галина", "Надежда", "Ксения",
    "Алёна", "Елизавета", "Валентина", "Нина", "Милана", "Таисия", "София",
    "Оксана", "Лидия", "Раиса", "Зинаида", "Тамара", "Юлия", "Диана", "Ангелина",
    "Ева", "Мирослава", "Любовь", "Регина", "Карина", "Инна", "Жанна",
    "Маргарита", "Алиса", "Вера", "Эльвира", "Люция", "Варвара", "Агния",
    "Снежана", "Эмма", "Майя", "Яна", "Кристина", "Серафима", "Зоя"
]

second_names_male = [
    "Иванов", "Смирнов", "Кузнецов", "Попов", "Васильев", "Петров", "Михайлов", "Новиков", "Федоров", "Кравцов",
    "Козлов", "Лебедев", "Соколов", "Морозов", "Волков", "Алексеев", "Соловьев", "Зайцев", "Степанов", "Сергеев",
    "Макаров", "Николаев", "Орлов", "Андреев", "Григорьев", "Захаров", "Борисов", "Яковлев", "Павлов", "Белов",
    "Комаров", "Киселев", "Семенов", "Егоров", "Титов", "Чернов", "Ширяев", "Романов", "Лазарев", "Гусев", "Дмитриев",
    "Моисеев", "Фомин", "Ильин", "Максимов", "Казаков", "Терентьев", "Жуков", "Сидоров", "Анисимов", "Балашов",
    "Воробьев", "Головкин", "Дроздов", "Емельянов", "Жданов", "Зайцев", "Исаев", "Казаков", "Лазарев", "Максимов",
    "Николаев", "Орлов", "Пономарев", "Романов", "Соколов", "Тихонов", "Федотов", "Хохлов", "Цыганов", "Шишкин",
    "Щербаков", "Юдин"
]

second_names_female = [
    "Смирнова", "Иванова", "Кузнецова", "Попова", "Васильева", "Петрова", "Михайлова", "Новикова", "Федорова",
    "Кравцова", "Козлова", "Лебедева", "Соколова", "Морозова", "Волкова", "Алексеева", "Соловьева", "Зайцева",
    "Степанова", "Сергеева", "Макарова", "Николаева", "Орлова", "Андреева", "Григорьева", "Захарова", "Борисова",
    "Яковлева", "Павлова", "Белова", "Комарова", "Киселева", "Семенова", "Егорова", "Титова", "Чернова", "Ширяева",
    "Романова", "Лазарева", "Гусева", "Дмитриева", "Моисеева", "Фомина", "Ильина", "Максимова", "Казакова",
    "Терентьева", "Жукова", "Сидорова", "Анисимова", "Балашова", "Воробьева", "Головкина", "Дроздова", "Емельянова",
    "Жданова", "Зайцева", "Исаева", "Казакова", "Лазарева", "Максимова", "Николаева", "Орлова", "Пономарева",
    "Романова", "Соколова", "Тихонова", "Федотова", "Хохлова", "Цыганова", "Шишкина", "Щербакова", "Юдина"
]

patronymics_male = [
    "Вашингтонович", "Алексеевич", "Сергеевич", "Иванович", "Андреевич",
    "Петрович", "Николаевич", "Владимирович", "Михайлович", "Евгеньевич",
    "Максимович", "Юрьевич", "Григорьевич", "Витальевич", "Викторович",
    "Арсеньевич", "Борисович", "Васильевич", "Валерьевич", "Геннадьевич",
    "Игоревич", "Константинович", "Кириллович", "Леонидович", "Мартынович",
    "Матвеевич", "Никитич", "Павлович", "Ростиславович", "Романович",
    "Станиславович", "Тимофеевич", "Эдуардович", "Юлианович", "Ярославович",
    "Захарович", "Федорович", "Платонович", "Семенович", "Артемович",
    "Антонович", "Анатольевич", "Савельевич", "Валентинович", "Денисович",
    "Петрович", "Филиппович", "Юрьевич", "Игнатьевич", "Алексеевич"
]

patronymics_female = [
    "Сергеевна", "Ивановна", "Николаевна", "Петровна", "Владимировна",
    "Михайловна", "Евгеньевна", "Андреевна", "Максимовна", "Юрьевна",
    "Григорьевна", "Витальевна", "Викторовна", "Олеговна", "Борисовна",
    "Леонидовна", "Артемовна", "Геннадьевна", "Игоревна", "Константиновна",
    "Кирилловна", "Васильевна", "Федоровна", "Романовна", "Юлиановна",
    "Дмитриевна", "Захаровна", "Семеновна", "Антоновна", "Павловна",
    "Эдуардовна", "Ярославовна", "Гавриловна", "Анатольевна", "Филипповна",
    "Елисеевна", "Валерьевна", "Глебовна", "Игнатьевна", "Валентиновна",
    "Аркадьевна", "Мироновна", "Руслановна", "Станиславовна", "Ростиславовна",
    "Матвеевна", "Алексеевна", "Федотовна", "Игнатьевна", "Лукинична"
]

genders = ["male", "female"]

data = []

for pk in range(1, 301):
    gender = random.choice(genders)
    if gender == "male":
        first_name = random.choice(first_names_male)
        second_name = random.choice(second_names_male)
        patronymic = random.choice(patronymics_male)
    else:
        first_name = random.choice(first_names_female)
        second_name = random.choice(second_names_female)
        patronymic = random.choice(patronymics_female)

    passenger = {
        "model": "passenger.passenger",
        "pk": pk,
        "fields": {
            "first_name": first_name,
            "second_name": second_name,
            "patronymic": patronymic,
            "phone": f"8900{random.randint(1000000, 9999999)}",
            "category": random.randint(1, 8),
            "gender": gender,
            "is_pacemaker": bool(random.getrandbits(1)),
            "description": ""
        }
    }
    data.append(passenger)

with open('passengers.json', 'w', encoding='utf-8') as f:
    json.dump(data, f, ensure_ascii=False, indent=4)
